src/DataProcessors/ЗагрузитьДемо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузитьДемо</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Documents/РеестрПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>РеестрПлатежей</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прочитан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Платежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСписания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ЗаявкаНаСогласование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ЗаявкаНаСогласование</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прочитан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ЗаявкаНаРасходованиеСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ЗаявкаНаРасходованиеСредств</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прочитан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Файлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.РеестрПлатежей</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаСогласование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЗаголовок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ЗагрузитьДемо/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗагрузитьДемоНаСервере()
	
	ОтветИзЦентра = Обработки.ЗагрузитьДемо.ПолучитьДемоДанные();
	
	Для каждого Ответ из ОтветИзЦентра Цикл
		
		Если Ответ.Тип = "РеестрПлатежей" Тогда
			
			СоздатьРеестрПлатежей(Ответ.Данные);
			
		ИначеЕсли Ответ.Тип = "ЗаявкаНаСогласование" Тогда
			
			СоздатьЗаявкуНаСогласование(Ответ.Данные);
			
		ИначеЕсли Ответ.Тип = "ЗаявкаНаРасходДС" Тогда
			
			СоздатьЗаявкуНаРасходДС(Ответ.Данные);
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеестрПлатежей(ДанныеДокумента)
	
	Реестр = Документы.РеестрПлатежей.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(Реестр, ДанныеДокумента,"Инициатор,СрокИсполнения, Сумма");  //Организация, Статья

	Реестр.Организация = НайтиОрганизацию(ДанныеДокумента.Организация);
	Реестр.Дата = ТекущаяДата();
	
	Для каждого Платеж из ДанныеДокумента.Платежи Цикл
		
		НоваяСтрока = Реестр.Платежи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Платеж);
		НоваяСтрока.Статья = НайтиСтатью(Платеж.Статья);
		
	КонецЦикла;	
			
	Реестр.Записать();
	
КонецПроцедуры	

&НаСервере
Процедура СоздатьЗаявкуНаСогласование(ДанныеДокумента)
	
	Заявка = Документы.ЗаявкаНаСогласование.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(Заявка, ДанныеДокумента,"Инициатор, СрокИсполнения, ЦФО, ОписаниеКраткое");  //Организация, Статья
	
	Заявка.Организация = НайтиОрганизацию(ДанныеДокумента.Организация);
	Заявка.Дата = ТекущаяДата();
	Заявка.Записать();
	
	Для каждого ф из ДанныеДокумента.Вложения Цикл 		
		НовыйФайл = Справочники.Файлы.СоздатьЭлемент();
		НовыйФайл.Наименование = Ф.Наименование;
		НовыйФайл.Расширение   = ф.Расширение;
		НовыйФайл.Размер       = ф.Размер;
		НовыйФайл.ВладелецФайла = Заявка.Ссылка;
		
		ДДФайла = Base64Значение(ф.Данные);
		НовыйФайл.Данные = Новый ХранилищеЗначения(ДДФайла, Новый СжатиеДанных(9));
		НовыйФайл.Записать(); 	
		
		НоваяСтрока = Заявка.Вложения.Добавить();
		НоваяСтрока.Файл = НовыйФайл;
	КонецЦикла;	
	
	Заявка.Записать();
	
КонецПроцедуры	

&НаСервере
Процедура СоздатьЗаявкуНаРасходДС(ДанныеДокумента)
	
	Заявка = Документы.ЗаявкаНаРасходованиеСредств.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(Заявка, ДанныеДокумента,"Инициатор, Контрагент, СрокИсполнения, ЦФО, ОписаниеКраткое, Сумма, Валюта");  //Организация, Статья
	
	Заявка.Статья      = НайтиСтатью(ДанныеДокумента.Статья);
	Заявка.Организация = НайтиОрганизацию(ДанныеДокумента.Организация);
	Заявка.Дата = ТекущаяДата();
	Заявка.Записать();
	
	Для каждого ф из ДанныеДокумента.Вложения Цикл 		
		НовыйФайл = Справочники.Файлы.СоздатьЭлемент();
		НовыйФайл.Наименование = Ф.Наименование;
		НовыйФайл.Расширение   = ф.Расширение;
		НовыйФайл.Размер       = ф.Размер;
		НовыйФайл.ВладелецФайла = Заявка.Ссылка;
		
		ДДФайла = Base64Значение(ф.Данные);
		НовыйФайл.Данные = Новый ХранилищеЗначения(ДДФайла, Новый СжатиеДанных(9));
		НовыйФайл.Записать(); 	
		
		НоваяСтрока = Заявка.Вложения.Добавить();
		НоваяСтрока.Файл = НовыйФайл;
	КонецЦикла;	
	
	Заявка.Записать();
	
КонецПроцедуры	

Функция НайтиСтатью(СтрокаСтатья)
	
	Статья = Справочники.СтатьиРасходов.НайтиПоНаименованию(СтрокаСтатья, Истина);
	
	Если ЗначениеЗаполнено(Статья) Тогда
		Возврат Статья;
	Иначе		
		НоваяСтатья = Справочники.СтатьиРасходов.СоздатьЭлемент();
		НоваяСтатья.Наименование =СокрЛП(СтрокаСтатья);
		НоваяСтатья.Записать();
		Возврат НоваяСтатья.Ссылка;
	КонецЕсли;	
	
КонецФункции

Функция НайтиОрганизацию(СтрокаОрганизация)
	
	Организация = Справочники.Организации.НайтиПоНаименованию(СтрокаОрганизация, Истина);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Возврат Организация;
	Иначе		
		НоваяОрганизация = Справочники.Организации.СоздатьЭлемент();
		НоваяОрганизация.Наименование =СокрЛП(СтрокаОрганизация);
		НоваяОрганизация.Записать();
		Возврат НоваяОрганизация.Ссылка;
	КонецЕсли;	
	
КонецФункции



&НаКлиенте
Процедура ЗагрузитьДемо(Команда)
	ЗагрузитьДемоНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаявку(Заявка)
	
	Задача = Документы.ЗаявкаНаРасходованиеСредств.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(Задача, Заявка,"Инициатор, Статья, ЦФО, ОписаниеКраткое, Сумма");
	Задача.Дата = ТекущаяДата();
	Задача.Записать();
	
	Для каждого ф из Заявка.Вложения Цикл 		
		НовыйФайл = Справочники.Файлы.СоздатьЭлемент();
		НовыйФайл.Наименование = Ф.Наименование;
		НовыйФайл.Расширение   = ф.Расширение;
		НовыйФайл.Размер       = ф.Размер;
		НовыйФайл.ВладелецФайла = Задача.Ссылка;
		
		ДДФайла = Base64Значение(ф.Данные);
		НовыйФайл.Данные = Новый ХранилищеЗначения(ДДФайла, Новый СжатиеДанных(9));
		НовыйФайл.Записать(); 	
		
		НоваяСтрока = Задача.Вложения.Добавить();
		НоваяСтрока.Файл = НовыйФайл;
	КонецЦикла;	
	
	Задача.Записать(); 
	
КонецПроцедуры

////////////////////////////////////////

&НаСервере
Процедура УдалитьДемоНаСервере()
	
	Заявки = Документы.ЗаявкаНаРасходованиеСредств.Выбрать();
	Пока Заявки.Следующий() Цикл
		Заявки.ПолучитьОбъект().Удалить();
	КонецЦикла;
	
	Заявки2 = Документы.ЗаявкаНаСогласование.Выбрать();
	Пока Заявки2.Следующий() Цикл
		Заявки2.ПолучитьОбъект().Удалить();
	КонецЦикла;
	
	Заявки3 = Документы.РеестрПлатежей.Выбрать();
	Пока Заявки3.Следующий() Цикл
		Заявки3.ПолучитьОбъект().Удалить();
	КонецЦикла;  
	            	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДемо(Команда)
	
	УдалитьДемоНаСервере();
	ПоказатьПредупреждение(, "Все удалили!");
	
КонецПроцедуры

///////////////////////////////////////

&НаКлиенте
Процедура ТестАудио(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда
		
		Если СредстваМультимедиа.ПоддерживаетсяАудиозапись() Тогда
			                   			
		 	ДанныеМультимедиа = СредстваМультимедиа.СделатьАудиозапись();
			
			Если ДанныеМультимедиа <> Неопределено Тогда 
				АудиоФ = ДанныеМультимедиа.ПолучитьДвоичныеДанные();
				СредстваМультимедиа.ВоспроизвестиАудио(АудиоФ);
			Иначе 
				Сообщить("Не записали!");
			КонецЕсли;	
				
		КонецЕсли;	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ВоспроизвестиАудио(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда
		      
		//Если СредстваМультимедиа.ПоддерживаетсяАудиозапись() Тогда			                   			
		// 	СредстваМультимедиа.ВоспроизвестиАудио(Аудио);    						
		//КонецЕсли;	
	#КонецЕсли

КонецПроцедуры
